{"posts":[{"title":"On the ethics of interpretation in Politics - A brief introduction","text":"Michael L. Frazer (2019), in his essay The Ethics of Interpretation in Political Theory and Intellectual History, provides a Habermasian-style of definition on ethics: “ (Ethics) is a realm of discourse in which any of us may be called to offer justifications of our activity in terms of values that we expect our interlocutors to share.” This definition expands the domain of ethics from an individual to a social level compared to the classical Platonic view on ethics. The ancient Greek view in general claims that ethics is based on one’s moral excellence, his ability to behave in line with his rationality. (Parry and Thorsrud, 2021) The involvement of politics is the predominant factor that distinguishes the two perspectives on ethics. The term ‘discourse’ that Frazer adopted is the key to understand such a difference. For example, in the recent Israel-Palestine conflict, both parties in the conflict have solid ethical justification for their violent behaviour in their own discourses that can find support in their sacred texts. The example of Israel-Palestine conflict illustrates the importance of the ethics of interpretation in politics because the ‘imaginative’ interpretation can lead to practical consequence of suffering for both parties in the conflict. Interpretation, in the political sphere, can be understood equally as narratives under a particular discourse. Hence, the main subject of study for academia is how narratives arises, in other words, why people from a particular community interpret things in their particular way. Additionally, there is also debate in the academia about how scholars should interpret classic political texts. On the construction and circulation of narratives, Jerome Bruner (1987) argues that narratives operate unconsciously at serval levels: daily activities, national strategies, and scholarly methodologies, it is a form of projection of the ‘societal will’. In an alternative linguistic view, Ferdinand de Saussure (2011) innovatively pointed out that language are rules and conventions of a signifying system, meaning-making is the social practice of particular speech-communities. Saussure’s view provokes later scholars to study the linguistic structure, especially its vocabulary system in daily usage, to investigate the source of narratives. In the academic sphere, Frazer (abid.) concludes three mainstreams of methodologies that scholars adopt in interpreting past political texts: 1) the historians, who treats political sciences fundamentally as a branch of history, 2) the ahistorians, who believes that political science is essentially ahistorical and 3) the presentists, which defies the historical-ahistorical bifurcation. Furthermore, Frazer posits that the choice of methodology for an individual scholar is essentially ethical because the validity of academic interpretation requires an interpersonally acceptable justification, hence the scholars bears interpersonal obligation in their studies. This introduction provides the readers of this blog a theoretical starting point of our summative group creative portfolio, which applies theories surrounding the ethics and politics of interpretation to the circumstances of the 2nd Amendment of the American constitution. Along with this introduction, there will be two aspects within the blog: a video presentation exploring the Second Amendment, with a specific focus at the political and the apolitical perspectives of hermeneutics. The second aspect will be an infographic detailing how ethics and hermeneutics align, delving deeper into the importance of interpretation for ethical discourse. This blog utilises theories and arguments in order to apply them in the context of one of America’s most fundamental entitlements. Notes: Bruner, J. (1987) ‘Life as Narrative’, Social Research, 54(1), pp. 11–32. doi:https://www.jstor.org/stable/40970444. Frazer, M.L. (2019) ‘The ethics of interpretation in political theory and intellectual history’, The Review of Politics, 81(1), pp. 77–99. doi:10.1017/s0034670518000967 Parry, R. and Thorsrud, H. (2021) Ancient ethical theory, Stanford Encyclopedia of Philosophy. Available at: https://plato.stanford.edu/entries/ethics-ancient/ (Accessed: 02 April 2024). Saussure, F. de (2011) Course in general linguistics. New York: Columbia University Press.","link":"/2024/04/02/3/"},{"title":"Ethics and Interpretation:Deeper into the Three Senses","text":"","link":"/2024/03/29/infographic/"},{"title":"The Political and the Apolitical Understanding of the 2nd Amendment","text":"","link":"/2024/03/29/Amendment/"}],"tags":[{"name":"TheUS, PoliticalPhilosophy","slug":"TheUS-PoliticalPhilosophy","link":"/tags/TheUS-PoliticalPhilosophy/"},{"name":"Gadamer, Ethics, PoliticalPhilosophy","slug":"Gadamer-Ethics-PoliticalPhilosophy","link":"/tags/Gadamer-Ethics-PoliticalPhilosophy/"}],"categories":[{"name":"Hermeneutics","slug":"Hermeneutics","link":"/categories/Hermeneutics/"}],"pages":[]}